// -*- coding: utf-8 -*-
// vim:fileencoding=utf-8
/**
@file MACROS.h
@author Devyn Collier Johnson <DevynCJohnson@Gmail.com>
@copyright LGPLv3

@brief Standard Macros Header with AT&T-style Assembly
@version 2017.07.15

@section DESCRIPTION
This file defines various datatypes, macros functions, names, and tests.
Substitutes for most standard C libraries are also provided.
 - http://pubs.opengroup.org/onlinepubs/9699919799/basedefs/contents.html
This is the primary MACROS*.h file, and this one should be included.
The other MACROS*.h files will automatically be included.

@section LICENSE
GNU Lesser General Public License v3
Copyright (c) Devyn Collier Johnson, All rights reserved.

This library is free software; you can redistribute it and/or
modify it under the terms of the GNU Lesser General Public
License as published by the Free Software Foundation; either
version 3.0 of the License, or (at your option) any later version.

This library is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
Lesser General Public License for more details.

You should have received a copy of the GNU Lesser General Public
License along with this library.

@section Supports
Compilers:
 - GNU-GCC
 - Clang & LLVM
Architectures:
 - x86-64
Operating Systems:
 - Linux

@section Standard C Library
 - <assert.h>
 - <complex.h>
 - <ctype.h>
 - <errno.h>
 - <fenv.h>
 - <float.h>

 - https://msdn.microsoft.com/en-us/library/b0084kay.aspx
 - http://clang.llvm.org/docs/LanguageExtensions.html

@section Cilk Documentation
 - https://www.cilkplus.org/
 - https://www.cilkplus.org/cilk-plus-tutorial
 - https://www.cilkplus.org/docs/doxygen/include-dir/
 - Intel Cilk Plus: https://software.intel.com/en-us/node/522579

@section Intel Documentation
 - Automatic Vectorization: https://software.intel.com/en-us/node/522569
 - Graphics Technology: https://software.intel.com/en-us/node/522438
 - High-Level Optimization (HLO): https://software.intel.com/en-us/node/522438
 - Intel Math Library: https://software.intel.com/en-us/node/522652
 - Interprocedural Optimization (IPO): https://software.intel.com/en-us/node/522666
 - OpenMP Support: https://software.intel.com/en-us/node/522678

@section Float-Point Documentation
 - Minifloat - https://en.wikipedia.org/wiki/Minifloat
 - Half-precision (binary16) - https://en.wikipedia.org/wiki/Half-precision_floating-point_format
 - Single-precision (binary32) - https://en.wikipedia.org/wiki/Single-precision_floating-point_format
 - Double-precision (binary64) - https://en.wikipedia.org/wiki/Double-precision_floating-point_format
 - Quadruple-precision (binary128) - https://en.wikipedia.org/wiki/Quadruple-precision_floating-point_format
 - Octuple-precision (binary256) - https://en.wikipedia.org/wiki/Octuple-precision_floating-point_format
 - Decimal32 - https://en.wikipedia.org/wiki/Decimal32_floating-point_format
 - Decimal64 - https://en.wikipedia.org/wiki/Decimal64_floating-point_format
 - Decimal128 - https://en.wikipedia.org/wiki/Decimal128_floating-point_format
 - IBM Floating Point Architecture - https://en.wikipedia.org/wiki/IBM_Floating_Point_Architecture

@section Metric Units for Decimal Data Units
 - Value	Abbr	Name
 - 1000		kB		Kilobyte
 - 1000^2	MB		Megabyte
 - 1000^3	GB		Gigabyte
 - 1000^4	TB		Terabyte
 - 1000^5	PB		Petabyte
 - 1000^6	EB		Exabyte
 - 1000^7	ZB		Zettabyte
 - 1000^8	YB		Yottabyte

@section ISO/IEC 80000 Units for Binary Data Units
 - Value	Abbr	Name
 - 1024		KiB		Kibibyte
 - 1024^2	MiB		Mebibyte
 - 1024^3	GiB		Gibibyte
 - 1024^4	TiB		Tebibyte
 - 1024^5	PiB		Pebibyte
 - 1024^6	EiB		Exbibyte
 - 1024^7	ZiB		Zebibyte
 - 1024^8	YiB		Yobibyte

@section Floating-Point Constant Literals
 - 5.3876e4 = 53876
 - 4e-11 = 0.00000000004
 - 1e+5 = 100000
 - 7.321E-3 = 0.007321
 - 3.2E+4 = 32000
 - 0.5e-6 = 0.0000005
 - 0.45 = 0.45
 - 6.e10 = 60000000000
*/


/* DIAGNOSTICS */


#ifndef MACROS_DIAGNOSTICS_H
/** If defined, the macros diagnostics header is already included/present; the included macros tests to ensure that `int` is 4 bytes (32-bits) in size, the space character is 0x20 in ASCII hexadecimal, etc.; If a test fails, the compilation will stop and an error message will be provided */
#define MACROS_DIAGNOSTICS_H   (1)


#if (('a' != 97) || ('z' != 122) || ('A' != 65) || (' ' != 0x20))  // File encoding test
#   error   "Invalid character encoding (must be UTF-8)!"
#endif


// DATATYPE SIZES
_Static_assert((sizeof(char) == 1), "`char` datatype is not 8-bits!");
_Static_assert((sizeof(int) == 4), "`int` datatype is not 32-bits!");
_Static_assert((sizeof(float) == 4), "`float` datatype is not 32-bits!");
_Static_assert((sizeof(double) == 8), "`double` datatype is not 64-bits!");
_Static_assert(((sizeof(char*) == 4) || (sizeof(char*) == 8)), "The target system is not 32-bit or 64-bit!");


// DETERMINE CHARACTER-SET
#define HOST_CHARSET_UNKNOWN   0
#define HOST_CHARSET_ASCII   1
#define HOST_CHARSET_EBCDIC   2
#if ('\n' == 0xA && ' ' == 0x20 && '0' == 0x30 && 'A' == 0x41 && 'a' == 0x61 && '!' == 0x21)
#   define HOST_CHARSET   HOST_CHARSET_ASCII
#   define IS_HOST_CHARSET_ASCII   0x1
#   define IS_HOST_CHARSET_EBCDIC   0x0
#elif ('\n' == 0x15 && ' ' == 0x40 && '0' == 0xF0 && 'A' == 0xC1 && 'a' == 0x81 && '!' == 0x5A)
#   define HOST_CHARSET   HOST_CHARSET_EBCDIC
#   define IS_HOST_CHARSET_ASCII   0
#   define IS_HOST_CHARSET_EBCDIC   1
#   error   "The host character set is EBCDIC!"
#else
#   define HOST_CHARSET   HOST_CHARSET_UNKNOWN
#   error   "Unrecognized host character set!"
#endif


// OPTIMIZATION MACROS (__OPTIMIZE__)
#if (defined(SSO_OPT) && (!defined(OPT_SSO)))
#   define OPT_SSO   (1)
#endif
#if (defined(SPEED_OPT) && (!defined(OPT_SPEED)))
